Revit 2024 API
RibbonItem Methods
The RibbonItem type exposes the following members.
Methods
Name | Description
Equals
 Determines whether the specified Object is equal to the current Object.
 (Overrides Object.Equals(Object).)
GetContextualHelp
Gets the contextual help bound with this control.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
SetContextualHelp
Sets the contextual help bound with this button.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
RibbonItem Class
Autodesk.Revit.UI Namespace